app/Controllers/Artikel.php

  public function add()
{
    $kategoriModel = new KategoriModel();
    $data['kategori'] = $kategoriModel->findAll(); // Fetch categories
---
SELECT *
FROM `kategori`